{
  "character_id": "chitin",
  "name": "Chitin",
  "type": "megascarab",
  "life_stage": "larva_to_adult",
  "visual_description": "A megascarab insect from Rimworld. As a larva: pale, grub-like with iridescent shell plates beginning to form, large dark compound eyes showing unusual intelligence. As adult: massive beetle-like creature with gleaming dark chitin armor, powerful mandibles, and distinctive iridescent patches that shift blue-green in light.",
  "reference_prompt_larva": "A pale megascarab larva the size of a cat rests on ancient stone, its grub-like body showing the first iridescent shell plates forming along its back. Large dark compound eyes reflect light with unusual intelligence and curiosity. Tiny mandibles twitch as it examines something off-frame. Soft bioluminescent mushroom light from below casts the creature in gentle purple-blue tones, highlighting the pearlescent sheen of its developing carapace. Style: Naturalistic creature design, science fiction biology. Mood: Curious, innocent, alien.",
  "reference_prompt_adult": "A massive megascarab beetle the size of a large dog stands protectively, its gleaming dark chitin armor reflecting ambient light. Powerful mandibles frame a surprisingly gentle posture. Iridescent patches along its carapace shift between deep blue and emerald green as light plays across the surface. Six powerful legs grip the ground with obvious strength. Dramatic side lighting emphasizes the sculptural quality of the chitin plates and the depth of its compound eyes. Style: Creature portrait, biological armor aesthetic. Mood: Powerful, loyal, ancient.",
  "key_visual_elements": [
    "dark chitin armor (glossy)",
    "iridescent blue-green patches",
    "large compound eyes",
    "powerful mandibles",
    "six segmented legs",
    "beetle-like body structure"
  ],
  "size_reference": {
    "larva": "cat-sized",
    "juvenile": "dog-sized",
    "adult": "large dog to small pony sized"
  },
  "personality_indicators": {
    "curious": "head tilted, antennae forward",
    "protective": "mandibles spread, body low",
    "content": "shell plates relaxed, soft clicking",
    "alarmed": "rigid posture, mandibles raised"
  }
}
